backend/tests/performance/inventory.performance.yml
config:
  target: "http://localhost:5000"
  phases:
    # Warm-up phase: 10 users over 30 seconds
    - name: "Warm Up"
      duration: 30
      arrivalRate: 10

    # Ramp-up phase: increase from 10 to 50 users over 60 seconds
    - name: "Ramp Up"
      duration: 60
      arrivalRate: 10
      rampTo: 50

    # Peak load phase: sustained 50 users for 60 seconds
    - name: "Peak Load"
      duration: 60
      arrivalRate: 50

    # Cool-down phase
    - name: "Cool Down"
      duration: 30
      arrivalRate: 5

  defaults:
    headers:
      Content-Type: "application/json"

  # Performance thresholds
  ensure:
    maxErrorRate: 5         # Max 5% error rate
    p99: 2000               # 99th percentile response time < 2000ms
    p95: 1000               # 95th percentile response time < 1000ms

scenarios:
  # Scenario 1: Public – Browse inventory (most common operation)
  - name: "Browse Inventory"
    weight: 40
    flow:
      - get:
          url: "/api/inventory"
          qs:
            page: 1
            limit: 10
          expect:
            - statusCode: 200

      - get:
          url: "/api/inventory"
          qs:
            category: "vegetables"
            page: 1
          expect:
            - statusCode: 200

      - get:
          url: "/health"
          expect:
            - statusCode: 200

  # Scenario 2: Read single item
  - name: "Read Single Item"
    weight: 20
    flow:
      - get:
          url: "/api/inventory"
          qs:
            limit: 1
          capture:
            - json: "$.data.inventory[0]._id"
              as: "inventoryId"
      - get:
          url: "/api/inventory/{{ inventoryId }}"
          expect:
            - statusCode: 200

  # Scenario 3: Alert endpoints (authenticated)
  - name: "Alert Checks"
    weight: 20
    flow:
      - get:
          url: "/api/inventory/alerts/low-stock"
          headers:
            Authorization: "Bearer {{ $env.PERF_TEST_TOKEN }}"
          expect:
            - statusCode: [200, 401]

      - get:
          url: "/api/inventory/alerts/expiring"
          qs:
            days: 7
          headers:
            Authorization: "Bearer {{ $env.PERF_TEST_TOKEN }}"
          expect:
            - statusCode: [200, 401]

  # Scenario 4: Stats dashboard
  - name: "Dashboard Stats"
    weight: 20
    flow:
      - get:
          url: "/api/inventory/stats/summary"
          headers:
            Authorization: "Bearer {{ $env.PERF_TEST_TOKEN }}"
          expect:
            - statusCode: [200, 401]